import streamlit as st
import time
import random

class DummyTextGenerator:
    def __init__(self):
        self.dummy_texts = [
        '''कमळ हे फूल मंद सुवासिक व आकर्षक असल्यामुळे ते सर्वाना आवडते. पांढरा, लाल ,गुलाबी, काळपट जांभळा असे कमळाचे विविध रंग असतात. कमळाची पाने मोठी व लेबगोल आकाराची असतात. कमळाच्या फुलाच्या देठांमध्ये हवेच्या पोकळया असतात. देळाची लांबी जास्त असते, दंठाचा रंग पाढरट- हिरवा असतो, देठाच्या पोकळीत हवा व पाणी भरल्याने हे देठ पाण्यावर ताठ उभे राहतात. कमळाच्या पानावर मेणासारखा पातळ थर असतो.त्यामुळे पाण्यात राहूनही ही पाने कुजत नाहीत. सरोवरात उमलणारी कमळे, ब्रह्मकमळ, कृष्णकमळ असे या फुलांचे प्रकार आहेत. ही फुले सरोवरात आणि तलावात उमलतात.

    ब्रम्हमकमळाचे रोप किंवा बी नसते. या फुलझाडांचे पान कुंडीत किंवा जमिनीत लावतात. पानाला पाने फुटत याचे राप तयार होते. ही झाडे साधारणत: एक ते दीड मीटर उंच असतात. यांना वर्षातून एकदाच फुले येतात. ब्रम्हकमळाचे फुल रात्री बारा वाजता उमलते. या झाडासमोर आपण बसून राहिलो तरी हे फुल उमललेले आपल्याला समजत नाही.

    कृष्णकमळाचा वेल असतो. वेलीला फुले आल्यावर हा वेल खूपच छान दिसतो.''',
    '''लेखन ही एक कला आहे. प्रयत्नाने ती आत्मसात करता येते. बरेच विघार्थी प्रशनांची उत्तरे तोंडी बराबर सांगतात पण्‍ लेखनात कमी पडतात. तर काहींना लेखनाच सरावच नसतो. हा लेख्नात कमी पडतात. तर काहींना लेखनाचा सरावच नसतो. हा लेखनसरव परीक्षेच्या द्र ष्टीने आवश्यक आहे. लेखनाने शुध्द्रलेखन सुधारते, अक्षरे वळणदार होतात. विचाीर सहप मांडता येतात, वाक्यांची रचना सहज व सुलभतेने प्राप्त होते.

    विघार्थ्यांच्या पालकांवर शालांत परीक्षेतील पन्नास टक्के निकाल अवलंबून असतो. केवळ शिकवण्या, पुस्तके, गाईड, वहया देऊन आपला पाल्या उत्तीर्ण हाणाीर नाहीख्‍ आई वडील टी.व्ही. समोर बसून आपल्या पाल्यास अभ्यास करण्यास सांगम असतील तर तो पाल्यावर अन्याय आहे असेच म्हणाचे लागेल. अभ्यास येते नाही, करीत नाही या सबबीवर पाल्यांना शिक्षा करणे अयाग्य ठरले. त्यांच्या अडचणींवर उपाय शोधावेत, त्यास अभ्यासास प्रवृत्त करावे, त्यास पाहटं उठवून आपण जागे राहावे, सातत्याने उपदेश करू नये, तिरस्कार, हटाळणी हे टाळावे, अति लाड करू नयेत, त्यांची जबाबदररी, कर्तव्य त्यास प्रसंगानुरु थोडक्यात व उदाहरणांसह पटवून घा. अभ्यासाची सक्ती नको ती शिक्षा ठरेल. अभ्यासाची गाडी वाढवण्यास पाषक वातावरणर पाहिजे.''',
           '''गांधी यांची एका शब्दा ओळख करून घ्यावची झाली, तर त्यासाठी समर्पक शब्द आहे, तो म्हणजे महामानव. गांधीजी स्वत:ला नेहमी एक सामानय माणूस मानत असत. त्यांची आपल्या हातून महात्मा घडलेल्या चुका प्रामाणिकपणे प्रयत्न केला. काेणत्याही महान गोष्टीचे माेजमापन करण्यासाठी मानदंड वापरला जातो. मानवतेचे मापन करण्यासाठी वापरला जाणार मानदंड म्हणजे गांधीजी होय.

    महात्माजींनी कोणतेही काम करताना मानवजातीचा विचार केला. ते वकिलीचा व्यवसाय करण्यासाठी अफ्रिकेत गेले होते, पण तेथील भारतीयांची दैन्यावस्था पाहून ते त्यांच्यामागे उभे राहिले, तेथील भारतीय जनतेवर जे अमानुष कायदे लादले गेले होते. त्यांच्याविरूध्द ते खंबीरपणे उभे राहीले.

    भारतात परत आल्यावर त्यांनी प्रथम संपूर्ण भारताचा प्रवास केले. सामन्य भारतीय हा अर्धनगन अवस्थेत वावरतो. अर्धपाेटी जगतो हे पाहून ते अस्वस्थ झाले. त्यांनी आपल्या पोशाखात, आपल्या आहारात आमूलाग्र बदल केला. भव्य प्रासादतुल्य बंगल्यात राहण्याएवजी कॉलनीत राहणे महात्मा गांधी यांनी अधिक पसंत केले.''',
            
            '''येथील लोकांनी असे कळवले आहे की त्यांचे गाव खेडेगाव हे वालदेवी नदीच्या काठी वसलेले आहे. गेल्य दीड-दोनशे वर्षा पासून ते या नदीतील पाणी शेताच्या उपयोगाासाठी वापरीत होते व आहेत.

या क्षेत्राात सैनिकी केंद्र झााल्यामुळे बऱ्याच वर्षा पासून नदीच्या पाण्याचा प्रवाह अडवला गेला आहे आणि एप्रिल पासून पुढे पाण्याची टंचाई जाणवते याचा त्यांच्या पाटबंधाऱ्यांवर परिणाम झाला आहे. त्यांच्या भरीस पाटबंणारे प्राधिकी हल्ला पाणपट्टी वसूल करीत आहेत. या पाण्याच्या वानरावर पाणीपट्टी बसवू नये व आर्थिक बोक्षा पडू नये, अशी या लोकांची विनंती आहे. या संबंधात, वालदेवी ही गोदावरी नदीची उपनदी असल्याचे पाटबंधारे अधिनियमाच्य कलम  अधिसूचित केले असे सांगण्यात आले आहे. एकदा नदी अ‍धिसूचित झााली म्हणजे पुर्वीचे सर्व अधिकार नाहीसे केले जातात आणि पाटबंधारे विभगकडून नदीचा पाणीपुरवठा नियंत्रित केला जातो. नदीच्या अधिसूचने नंतर पाटाचा उपयोग करणारे लोक पाटबंधारे अधिनियमाच्या 31 व्या कलमा नुसार.

''',

'''आपल्या मुलभूत गरजांपैकी निवायाची गरज ही आपल्या प्रत्येकासाठी जिव्हाळयाची असते. अर्थात, त्याचं कारणही तसंच असतं. ही गरज क्षणिक नसून कउाचित आयुष्यभरासाठी सुध्दा अपेक्षित आणि उपयुथ्त ठरत असते. अन्न आणि वस्त्र या दोन बाबी मात्र आपल्या किवळ काही क्षणाच्या गरजा भागविण्यापुरत्याच असतात, परंतु निवास हा मात्र निरंतर असतो आणि त्यासाठी त्याचा निवाडादेखील व्हावा लागतो.

 जेव्हा विषय घरारचा असतो त्यावेळेला तो व्यकितगत स्वरूपाचा नसतो तर तो संपूर्ण कुट्रंबाशी संबंधित असतो. परंतु अन्न आणि वस्त्र मात्र वौयक्तिक गरजा भागविणायाच असतात. केवळ या दोन गरजांची पूर्तता व्यक्तिनुरूप ठरत असते. पण घराची निवड मात्र संपूर्ण कुटंबासाठी असलयामुळे ती व्यक्तीकेंद्रीत नसते. अन्न, वस्त्र निवडतांना सवड महत्वाची उसते. अनेकदा या निवडीमध्ये मर्यादा येतात, त्या केवळ आर्थिक कुवतीमुळे. कारण या तीन गरजांमधून हीच गरज अधिक महाग असते. पण अन्न, वस्त्र मात्र तुलनेने कमी खर्चात उपलब्ध होऊ शकतात.''',

 '''पेशव्यांच्या राज्याच्या उत्पन्नाचा विचार करीत असताना चौथाई व सादेशमुखी या दोप बाबींपासून त्यांना सतत उत्पन्न मिळत असे ही महत्वाची गोष्ट आहे. चौथाईचे मुळ शिवकालाच्या पुर्वीचे होंते. इ. स. 1579 मध्ये पोर्तुगीजांनी रामनगर कोळी राजास त्याने पोर्तुगीजांच्या ताब्यातील मुलुखांवर हल्ले करून लुटू नये म्हणून दरसाल चौथई देण्याचे कबूल केले होते.

त्यानंतर शिवाजी महाराजांनी आपले राज्या बळकट करण्यासाठी शत्रूच्या प्रदेशातून पैसा वसूल केला. चौथाई व सरदेशमुखी या दोन बाबींपासून शिवाजी महाराजांना भरपूर उत्पन्न मिळत असे. शिवाजी महाराजांचे चौथाई वसूल करण्याचे कौशल्य वाखाणण्यासारखे आहे. मुघलांबरोबर सतत युध्द चालू असताना औरंगजेब सुध्दा शिवाजी महाराजांच्या धेरणामुळे गोंधळून गेला. कारण मयाच्या प्रदेशातील लोकांना चौथाई दृयावह लागत असे. शिवाजी राजांनंतर संभाजी राजे, राजाराम व शिवाजी दुसरा यांच्याही कारकिर्दीत मुघलाई मुलुखातील चौथाई अंमलाची वहिवाट चालू होती.''',
'''कर्नाटकातील दक्षिण कॅनरा हा जो जिल्हा आहे तो फारच आगळावेगळा आहे. येथे साक्षरतेचं प्रमाण फार मोठं आहे. येथील जोक उद्श्मशील आहे, कष्टाळू आहेत. कामाच्या शोधात ते जगभर जाऊन पोहाचले आहेत. आपल्याला भारतात किंवा जगाच्या कोणत्याही कानाकांपऱ्यात एखांद उडप्याचं हॉटेल दिसलं, तर ते हमखास या दक्षिण कॅनरामधल्याच कोणीतरी चालू केलेलं असणार.

इन्फोसिस फौंडेशनचा एक उपक्रम आह. प्रत्येक शाळेसाठी वाचनालय. या उपक्रमांतर्गत आम्ही बरेच वेळा सरकारी शाळांना पुस्तक रूपाने देणगी देत असतो. म्हणजे मग तया शाळेत शिकणाऱ्या मुलामुलींना अगदी लहान वयातच वाचनासाठी पुस्तकं उपलब्ध होतात. यासाठी मी प्रचंड प्रवास करते, विशेषत खेडोपाड्यात आणि कन्नड भाषेत लिहिलेली विविध विषयांवरील पुस्तकं खेडयांमधील शाळांना दंणगी म्हणून देते. या प्रवासामुळेच वेगवेगळया भागात राहणाऱ्या मुलांना नेमके काय वाचायला आवछतं, हे आता मला नीट समजू लागलं आहे. साधारणपणे मी गावातील प्रत्येक शाळेला भेट देते. त्या अगदीच लहान असतात.''',

'''जीवन म्हणजे एक कोरा चेक आहे. त्यावर सुखाची वाटेल तेवढी रक्कम लिहीणे हे मनुष्याच्या कक्षेत आहे. पण ती आशेच्या शइ्रने, हास्याच्या टिपत्रकागदाने टिपली पाहिजे. जीवनाविषयीचे हे सुंदर तत्वज्ञान ऐकून मानवी मनाला सुखद धक्का बसेल हे जितके खरे आहे, तितकेच त्या जीवनात खोलवर दृष्टी टाकूप ठाव घेतो म्याला या जीवनात गुढतेचा वास्तवादी अर्थ कळतो.

जीवन म्हणजे वेल आहे व त्यावर सुख, ही असणारी फुले आहेत. मग या दु:खाचे वाईट वाटण्याचे कारण नाही. जीवनात दु:ख आहे म्हणूनच सुखाची आपल्याला किंमत कळते. भट्टीत तापवून निघाल्याखेरीज सोन्याला तेज चढत नाही. जगात अंधारी रात्र आहे, म्हणूनच चंदाला महत्व आहे. सुखानंतर दु:ख आले तर त्याची लज्जत न्यारीच असते. जीवन म्हणजे सुख व दु:खाचा चित्रपट आहे. परीक्षेसाठी कष्ट केल्यानंतर निकालाच त्या आनंदाची खरीखुरी गोडी अनुभवता येते. तद्वत आपल्या जीवनात येणारी दु:खे आपल्या व्यक्ती मत्वाची कसोटी घेण्यासाठीच येत असतात. अशावेळी दु:खांना सामोरे जावेच लागते.'''
                   ]
        self.current_text = ""

    def generate_dummy_text(self):
        self.current_text = random.choice(self.dummy_texts)
        return self.current_text

def calculate_accuracy(original_text, typed_text):
    correct_chars = sum([1 for c1, c2 in zip(original_text, typed_text) if c1 == c2])
    total_chars = len(original_text)
    accuracy = (correct_chars / total_chars) * 100
    return accuracy

def calculate_speed(original_text, typed_text, time_elapsed):
    words_original = len(original_text.split())
    words_typed = len(typed_text.split())
    minutes = time_elapsed / 60 if time_elapsed > 0 else 1  # To avoid division by zero
    speed = (words_typed / minutes)
    return speed

def format_time(seconds):
    minutes = seconds // 60
    seconds %= 60
    return f"{minutes:02d}:{seconds:02d}"

def format_time(seconds):
    minutes = seconds // 60
    seconds %= 60
    return f"{minutes:02d}:{seconds:02d}"

def main():
    st.title("For MPSC Student Skill Test For Typing Speed and Accuracy Checker")

    generator = DummyTextGenerator()

    if 'start_time' not in st.session_state:
        st.session_state.start_time = 0
        st.session_state.text = ""
        st.session_state.is_typing_enabled = False

    remaining_time = max(0, 600 - (time.time() - st.session_state.start_time)) if st.session_state.start_time > 0 else 0

    if st.session_state.start_time > 0 and remaining_time > 0:
        # st.subheader(f"Time Left: {format_time(int(remaining_time))}")
        # st.empty()
        # ph = st.empty()
        # N = 10*60
        # for secs in range(N,0,-1):
        #     mm, ss = secs//60, secs%60
        #     ph.metric("Countdown", f"{mm:02d}:{ss:02d}")
        #     time.sleep(1)
        pass

    if st.session_state.start_time == 0 or remaining_time > 0:
        col1, col2 = st.columns([3, 2])
        with col1:
            st.subheader("Practice Typing Here:")
            original_text = generator.generate_dummy_text()
            st.write(original_text)
            start_button = st.button("Start Typing Test")
            if start_button:
                st.session_state.start_time = time.time()
                st.text("Timer started. You have 10 minutes.")
        with col2:
            if st.session_state.start_time > 0:
                st.session_state.text = st.text_area("Type Here:", height=400, value=st.session_state.text)
                time_elapsed = time.time() - st.session_state.start_time if st.session_state.start_time > 0 else 0

                if time_elapsed <= 600:
                    accuracy = calculate_accuracy(generator.current_text, st.session_state.text)
                    speed = calculate_speed(generator.current_text, st.session_state.text, time_elapsed)
                    st.write(f"Accuracy: {accuracy:.2f}%")
                    st.write(f"Speed: {speed:.2f} words per minute")

                else:
                    st.warning("Time's up!")
                    st.session_state.is_typing_enabled = False

    else:
        accuracy = calculate_accuracy(generator.current_text, st.session_state.text)
        speed = calculate_speed(generator.current_text, st.session_state.text, 600)
        st.subheader("Typing Accuracy and Speed:")
        st.write(f"Accuracy: {accuracy:.2f}%")
        st.write(f"Speed: {speed:.2f} words per minute")

if __name__ == "__main__":
    main()